### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.io_platform_apim_api_itn.module.external_api_session_manager_revision_2.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + api_type              = "http"
      + description           = "Auth & Identity Session Manager External API"
      + display_name          = "IO SESSION MANAGER EXTERNAL API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-session-manager-external-api-v1"
      + path                  = "api/auth"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "2"
      + service_url           = "https://io-p-weu-session-manager-app-03.azurewebsites.net/api/auth/v1"
      + subscription_required = false
      + version               = "v1"
      + version_set_id        = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apiVersionSets/io_auth_v1"

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-auth-n-identity-domain/refs/tags/io-session-manager%401.9.2/apps/io-session-manager/api/external.yaml"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.io_platform_apim_api_itn.module.external_api_session_manager_revision_2.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-session-manager-external-api-v1"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                  <inbound>
                    <base />
                  </inbound>
                  <backend>
                      <base />
                  </backend>
                  <outbound>
                      <base />
                  </outbound>
                  <on-error>
                      <base />
                  </on-error>
              </policies>
        EOT
    }

  # module.io_platform_apim_api_itn.module.external_api_session_manager_revision_2.azurerm_api_management_product_api.this["io-auth"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-session-manager-external-api-v1"
      + id                  = (known after apply)
      + product_id          = "io-auth"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.pub_session_manager_bis.module.service_bus.azurerm_role_assignment.topics["/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01|io-auth-sessions-topic|writer"] will be created
  + resource "azurerm_role_assignment" "topics" {
      + condition_version                = (known after apply)
      + description                      = "This role allows managing the given topic"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "35466a0f-77fa-4b25-8a96-091063c0d882"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Data Sender"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01/topics/io-auth-sessions-topic"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>
